Revit 2024 API
ExportPatternTable.GetKeys Method
 Gets all the keys stored in the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public IList<ExportPatternKey> GetKeys()
Visual Basic
Public Function GetKeys As IList(Of ExportPatternKey)
Visual C++
public:
IList<ExportPatternKey^>^ GetKeys()
Return Value
 Return the key array.
See Also
ExportPatternTable Class
Autodesk.Revit.DB Namespace